{
    "event_id": "hackelite_April",
    "event_name": "Hackelite",
    "event_dates": "April 30",
    "event_location": "CSI",
    "problem_statement": "Problem Title: Personalized Learning Pathways Using AI\n\nDescription: Traditional education often fails to cater to individual learning paces and preferences. Create an AI-powered platform that designs dynamic and personalized learning pathways for students, adapting materials and pacing based on real-time performance metrics and learning style assessments.\n\nRelevant Research Areas: AI, Education Technology, Human-Computer Interaction",
    "sponsors": [
        "indrasenakalyanam@gmail.com"
    ],
    "marketing_materials": {
        "poster_description": "\n**Event**: Hackelite  \n**Dates**: April 30  \n**Location**: CSI  \n**Tagline**: \"Innovate, Create, and Elevate your Tech Skills!\"\n\n---\n\n",
        "email_templates": "\n**Student Email Template:**  \nSubject: 🚀 Join Us at Hackelite – A Day of Innovation Awaits!  \n\nHi [Student's Name],  \n\nAre you ready to embrace a day filled with tech, innovation, and excellent networking opportunities? Hackelite is coming this April 30 at CSI, and you won't want to miss it!  \n\n**What's in store?**  \n- Skill-building Workshops  \n- Networking Opportunities  \n- Exciting Prizes!  \n\nRegister now and mark your calendars to innovate, create, and elevate your tech journey!  \n\n[Register Here]\n\nLooking forward to seeing you,  \n[Event Organizer Team]  \n\n---\n\n**Faculty Email Template:**  \nSubject: Invitation to Engage with Aspiring Innovators at Hackelite  \n\nDear [Faculty's Name],  \n\nWe’re thrilled to announce Hackelite, an exciting one-day event designed to bridge innovation and collaboration for our students on April 30 at CSI.  \n\nYour presence as a mentor or participant would greatly enrich the experience for these aspiring innovators. Please join us to guide, support, and network!  \n\nFor more details or to sign up, click below:  \n[Explore Hackelite]  \n\nWarmest regards,  \n[Event Organizer Team]  \n\n---\n\n**Sponsor Email Template:**  \nSubject: Exclusive Sponsorship Opportunity – Hackelite 2023  \n\nDear [Sponsor's Name],  \n\nHackelite is approaching fast, and we are looking for forward-thinking sponsors like you to make this event a grand success. Hosting over 100 tech enthusiasts at CSI on April 30, Hackelite promises a day brimming with innovation and collaboration.  \n\nAs a sponsor, you can:  \n- Interact with top talents  \n- Showcase your brand prominently  \n- Contribute to empowering the next generation of innovators  \n\nJoin us and be part of this transformative event!  \n\n[Become a Sponsor Today]  \nLooking forward to an impactful collaboration,  \n[Event Organizer Team]\n\n---\n\n",
        "social_media_posts": "\n1. **Instagram Post**  \n🚀 Gear up, hackers! Hackelite is coming to CSI on April 30. A fun day to innovate, create, and network! 🖥️ Who’s joining?  \n👨‍💻 #Innovation #Hackelite2023  \n\n2. **Twitter Post**  \n📢 Exciting news! April 30, CSI – Hackelite. Where young minds come to innovate ✨. Don’t miss the workshops, networking, and fabulous prizes. #Hackelite  \n\n3. **LinkedIn Post**  \nHackelite 2023 is here! Taking place at CSI on April 30, this event will provide students with invigorating workshops, networking opportunities, and one thrilling day of collaboration. 📍Mark your calendars!  \n\n4. **Instagram Stories Template**  \n🎉 Let's Hack it! Hackelite @ CSI this *April 30*. Come for the tech, stay for the prizes! Don't miss it out. Swipe up to know more!  \n\n5. **Facebook Post**  \n⏳ Countdown Begins! Hackelite is your chance to innovate, network, and win it all, happening April 30 at CSI. Join the fun and make an impact!  \n\n---\n\n",
        "poster_slogans": "\n1. \"Hackelite: Innovate, Create, and Elevate!\"  \n2. \"Where Tech Innovators Unite.\"  \n3. \"One Day of Endless Possibilities – Hackelite 2023!\"  \n4. \"April 30: Redefine Innovation.\"  \n5. \"CSI, Be There to Hack the Future!\"  \n\n---\n\n",
        "audience_segmentation": "\n**Students**: Highlight workshops, skill improvement, prizes, and networking opportunities.  \n\n**Faculty**: Promote mentoring roles, collaboration opportunities with students, and academic engagement in tech.  \n\n**Sponsors**: Focus on brand visibility, direct interaction with tech talent, and contribution towards fostering innovation.  \n\n---\n\n",
        "posting_calendar": "\n**Week 1:**  \n- Day 1: Announce Hackelite on all social platforms (USP: prizes, workshops).  \n- Day 3: Faculty-focused LinkedIn post for mentorship roles.  \n- Day 5: Sponsor outreach through LinkedIn and Instagram.  \n\n**Week 2:**  \n- Day 1: Share past event highlights to build excitement.  \n- Day 3: Start a countdown – 3 days to Hackelite (focus on workshops).  \n- Day 5: Encourage last-minute registrations through Instagram Stories and Twitter.\n\n---\n\n"
    },
    "logistics_summary": null,
    "catering_email_sent": false
}